In [ ]:
##(1).   Create a table called employees with the following structure?
# emp_id (integer, should not be NULL and should be a primary key)Q
# emp_name (text, should not be NULL)Q
 #age (integer, should have a check constraint to ensure the age is at least 18)Q
 #email (text, should be unique for each employee)Q
 #salary (decimal, with a default value of 30,000).


create database if not exists pw;
use pw;
create table if not exists  employees(
emp_id int  primary key,
emp_name varchar(25) not null,
age int check (age>=18),
email varchar(40) unique,
salary decimal default (30000));
use pw;

ques 2   Explain the purpose of constraints and how they help maintain data integrity in a database. Provideexamples of common types of constraints.


ANS- SQL Constraints are used to specify rules for data.
Constraints restrict the type of values that can be stored in a column
 Constraints prevent duplicate records where uniqueness is required, such as for primary keys.
Constraints maintain valid relationships between tables, preventing orphaned records.

 EXAMPLE- NOT NULL
         UNIQUE
         PRIMARY KEY
         DEFAULT
         CHECK


ques 3  Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justifyyour answer.

ANS- when we have to fill the column it means when a column should not be blank that time we have to give NOT NULL constraints .

 for example SR NO , ROLL NO , ORDER ID , CUSTOMER ID .

 yes a PRIMARY KEY contains not null and unique constraints.

ques 4  Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint

ANS- If i have a table named as employees and which have a column name as Salary and i  have to chanmge their datatypes from decimal to int  or constraints i have to follow following steps:

* ALTER employees
* MODIFY salary int;
* to drop constraints
* ALTER EMPLOYEES
* DROP CONSTRAINTS salary;

ques 5 - Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.Provide an example of an error message that might occur when violating a constraint.


ANS- If i gived salary column as int not null constraints and i want to put in any decimal no or if i forget to insert any no then SQL gives me error that salary should not be null or decimal value.

 for example insert into salary values __(empty)

 error code 1048- salary should not be null

ques 6  You created a products table without constraints as follows:

 CREATE TABLE products (

 product_id INT,

 product_name VARCHAR(50),

 price DECIMAL(10, 2));

 ans- *  ALTER TABLE products
 *   modify product_id int primary key,
 *  modify price decimal(10,2) default(50.00);

In [ ]:
#ques 7 Write a query to fetch the student_name and class_name for each student using an INNER JOIN


SELECT students.student_name, classes.class_name
FROM students
INNER JOIN classes
 ON students.class_id = classes.class_id;

In [ ]:
#(8)-Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are
#listed even if they are not associated with an order
#ans-
use pw;
create table orders (
order_id int,
order_date date,
customer_id int) ;
create table customers (
customer_id int ,
customer_name varchar (50));
create table products(
product_id int,
product_name varchar(50),
order_id int );
insert into orders
values (1,'2024-01-01',101),
(2,'2024-01-03',102);
insert into customers values
(101,"Alice"),
(102,"Bob");
insert into products values
(1,"Laptop",1),
(2,"Phone",null );

SELECT orders.order_id, customers.customer_name, products.product_name
FROM products
inner JOIN orders ON products.order_id = orders.order_id
left JOIN customers ON orders.customer_id = customers.customer_id;

In [ ]:
#(9)-Write a query to find the total sales amount for each product using an INNER JOIN and the SUM
#ANS-
use pw;
create table Sales(
sale_id int,
product_id int,
ammount int);
insert into Sales values
(1,101,500),
(2,102,300),
(3,101,700);
create table Product(
product_id int,
product_name varchar(50));
insert into Product values
(101,"Laptop"),
(102,"Phone");
SELECT p.product_name, SUM(s.ammount) AS total_sales
FROM Sales s
INNER JOIN Product p ON s.product_id = p.product_id
GROUP BY p.product_name;

In [ ]:
#|(10)-Write a query to display the order_id, customer_name, and the quantity of products ordered by each
#customer using an INNER JOIN between all three tables.
#AMS=
use pw;
create table order1 (
order_id int,
order_date date,
customer_id int) ;
create table customer (
customer_id int ,
customer_name varchar (50));
create table ORDER_DETAILS(
order_id int,
product_id int,
quantity int );
insert into order1
values (1,'2024-01-01',1),
(2,'2024-01-03',2);
select*FROM ORDER1;
insert into customer values
(101,"Alice"),
(102,"Bob");
insert into ORDER_DETAILS values
(1,101,2),
(1,102,1),
(2,101,3);

select order1,order_id,customer.customer_name,ORDER_DETAILS.quantity
from ORDER_DETAILS
inner join customer
on order1.customer_id=customer.customer_id
inner join order1
on order1.order_id=ORDER_DETAILS.ORDER_ID;
SELECT order1.order_id,customer.customer_name, SUM(ORDER_DETAILS.quantity) AS total_quantity
FROM order1 o
INNER JOIN customer c ON o.customer_id = c.customer_id
INNER JOIN ORDER_DETAILS od ON o.order_id = od.order_id
GROUP BY o.order_id, c.customer_name;

**SQL Commands**

 ques 1 -Identify the primary keys and foreign keys in maven movies db. Discuss the differences.


  A primary key is a unique identifier for a record in a table. It ensures that each row in a table can be uniquely identified.

  A foreign key is a field (or collection of fields) in one table that uniquely identifies a row of another table. The foreign key is used to establish and enforce a link between the data in two tables

In [ ]:
#ques 2  List all details of actors

use sakila;
select*from actor;

In [ ]:
#ques 3 List all customer information from DB.
SELECT * FROM Customers;

In [ ]:
#ques 4 List different countries
select country from country;

In [ ]:
#ques 5  Display all active customers
select first_name,active from customer;

In [ ]:
#ques 6 List of all rental IDs for customer with ID 1
select rental_id,customer_id from rental
where customer_id in (1);

In [ ]:
#ques 7  Display all the films whose rental duration is greater than 5
select title, rental_duration from film
where rental_duration>5;

In [ ]:

# ques 8 List the total number of films whose replacement cost is greater than $15 and less than $20.
select replacement_cost,title from film
where replacement_cost between 15 and 20;

In [ ]:
#ques 9  Display the count of unique first names of actors.
select count(distinct first_name) from actor;

In [ ]:
#ques 10 Display the first 10 records from the customer table
select*from customer
limit 10;

In [ ]:
# ques 11 Display the first 3 records from the customer table whose first name starts with ‘b’
select*from customer
where first_name like 'b%'
limit 3;

In [ ]:
#ques 12 Display the names of the first 5 movies which are rated as ‘G’
select title,rating from film
where rating='G'
limit 5;

In [ ]:
#ques 13 Find all customers whose first name starts with "a".
select first_name from customer
where first_name like 'a%';

In [ ]:
#ques 14  Find all customers whose first name ends with "a".
select first_name from customer
where first_name like '%a';

In [ ]:
#ques 15 Display the list of first 4 cities which start and end with ‘a’ .
select * from city
where city like 'a%a'
limit 4;

In [ ]:
#ques 16 Find all customers whose first name have "NI" in any position
select * from customer
where first_name like '%NI%';

In [ ]:
#ques 17 Find all customers whose first name have "r" in the second position
select * from customer
where first_name like '_r%';

In [ ]:
#ques 18  Find all customers whose first name starts with "a" and are at least 5 characters in length
select * from customer
where first_name like 'a%' and length(first_name)>=5;

In [ ]:
#ques 19 Find all customers whose first name starts with "a" and ends with "o"
select * from customer
where first_name like 'a%o';

In [ ]:
#ques 20 Get the films with pg and pg-13 rating using IN operator
select *from film
where rating in ('pg','pg-13');

In [ ]:
#ques 21 Get the films with length between 50 to 100 using between operator.
select *from film
where length between 50 and 100;

In [ ]:
#ques 22  Get the top 50 actors using limit operator
select *from actor
limit 50;

In [ ]:
#ques 23 - Get the distinct film ids from inventory table.
select* from inventory
where film_id in(select distinct film_id from inventory);

**Functions**

In [ ]:
# Quest 1: Retrieve the total number of rentals made in the Sakila database.

 SELECT COUNT(*) AS total_rentals
FROM rental;

In [ ]:
# Ques 2: the average rental duration (in days) of movies rented from the Sakila database.


 SELECT AVG(rental_duration) as avg_rental_duration
FROM rental;

In [ ]:
# ques 3 Display the first name and last name of customers in uppercase.
select upper(first_name) as FIRST_NAME,
upper(last_name) as LAST_NAME
from customer;

In [ ]:
#ques 4  Extract the month from the rental date and display it alongside the rental
SELECT rental_id, rental_date, MONTH(rental_date) AS rental_month
FROM rental;

In [ ]:
#ques 5 Retrieve the count of rentals for each customer display customer ID and the count of rent

SELECT customer_id, COUNT(*) AS rental_count
FROM rental
GROUP BY customer_id;

In [ ]:
#ques 6 Find the total revenue generated by each store
SELECT store_id, SUM(amount) AS total_revenue
FROM payment
GROUP BY store_id;

In [ ]:
# ques 7 Determine the total number of rentals for each category of movies.


SELECT c.name AS category_name, COUNT(r.rental_id) AS rental_count
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY c.name;

In [ ]:
#ques 8 Find the average rental rate of movies in each language
SELECT l.name AS Language, AVG(f.rental_rate) AS Avg_Rental_Rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.name;

In [ ]:
#ques 9 Display the title of the movie, customer's first name, and last name who rented it.

SELECT f.title AS Movie_Title,
  c.first_name AS Customer_First_Name,
  c.last_name AS Customer_Last_Name
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN customer c ON r.customer_id = c.customer_id;

In [ ]:
#ques 10  Retrieve the names of all actors who have appeared in the film "Gone with the Wind."
SELECT a.first_name AS Actor_First_Name,
       a.last_name AS Actor_Last_Name
FROM actor a
JOIN film_actor fa ON a.actor_id = fa.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.title = 'Gone with the Wind';

In [ ]:
#ques 11 Retrieve the customer names along with the total amount they've spent on rentals.
 SELECT c.first_name AS Customer_First_Name,
        c.last_name AS Customer_Last_Name,
       SUM(p.amount) AS Total_Spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id
ORDER BY Total_Spent DESC;

In [ ]:
#ques 12 List the titles of movies rented by each customer in a particular city (e.g., 'London').

SELECT c.first_name AS Customer_First_Name,
       c.last_name AS Customer_Last_Name,
       f.title AS Movie_Title
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London'
ORDER BY c.last_name, c.first_name, f.title;

In [ ]:
#ques 13 Display the top 5 rented movies along with the number of times they've been rented.

SELECT f.title AS Movie_Title,
       COUNT(r.rental_id) AS Rental_Count
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.film_id
ORDER BY Rental_Count DESC
LIMIT 5;

In [ ]:
# ques 14 Determine the customers who have rented movies from both stores (store ID 1 and store ID 2).
 SELECT c.first_name AS Customer_First_Name,
        c.last_name AS Customer_Last_Name
FROM customer c
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
WHERE i.store_id IN (1, 2)
GROUP BY c.customer_id
HAVING COUNT(DISTINCT i.store_id) = 2;

**Windows Function**

In [ ]:
#ques 1  Rank the customers based on the total amount they've spent on rentals.
select customer.first_name,payment.amount
from payment
left join customer
on customer.customer_id=payment.customer_id
order by payment.amount desc;

In [ ]:
# ques 2  Calculate the cumulative revenue generated by each film over time.

SELECT FILM.TITLE AS FILM ,SUM(PAYMENT.AMOUNT) AS REVENUE
FROM PAYMENT
INNER JOIN FILM
ON FILM.LAST_UPDATE=PAYMENT.LAST_UPDATE
GROUP BY FILM.TITLE;

In [ ]:
# ques 3 Determine the average rental duration for each film, considering films with similar lengths.
SELECT f.title AS film,
       f.length AS film_length,
       ROUND(AVG(DATEDIFF(r.return_date, r.rental_date)), 2) AS avg_rental_duration
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
GROUP BY f.title, f.length
ORDER BY f.length, avg_rental_duration DESC;

In [ ]:
# ques 4 . Identify the top 3 films in each category based on their rental counts
use sakila;
SELECT
    f.title,
    r.rental_date,
    f.rating,
    r.rental_id
FROM rental r
INNER JOIN inventory i ON r.inventory_id = i.inventory_id
INNER JOIN film f ON i.film_id = f.film_id;

In [ ]:
#ques 5 Calculate the difference in rental counts between each customers total rentals and the average rentals
    #across all customers

SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    COUNT(r.rental_id) AS total_rentals,
    (COUNT(r.rental_id) - avg_rentals.avg_rental_count) AS rental_difference
FROM customer c
LEFT JOIN rental r ON c.customer_id = r.customer_id
CROSS JOIN (
    SELECT AVG(rental_count) AS avg_rental_count
    FROM (
        SELECT customer_id, COUNT(rental_id) AS rental_count
        FROM rental
        GROUP BY customer_id
    ) AS customer_rentals
) AS avg_rentals
GROUP BY c.customer_id, avg_rentals.avg_rental_count
ORDER BY rental_difference DESC;

In [ ]:
#ques 6  Find the monthly revenue trend for the entire rental store over time.

SELECT
    DATE_FORMAT(p.payment_date, '%Y-%m') AS month,
    SUM(p.amount) AS total_revenue
FROM
    payment p
GROUP BY
    month
ORDER BY
    month ASC;

In [ ]:
# 7  Identify the customers whose total spending on rentals falls within the top 20% of all customers.
WITH customer_spending AS (
    SELECT
        c.customer_id,
        c.first_name,
        c.last_name,
        SUM(p.amount) AS total_spent,
        NTILE(5) OVER (ORDER BY SUM(p.amount) DESC) AS spending_rank
    FROM customer c
    JOIN rental r ON c.customer_id = r.customer_id
    JOIN payment p ON r.rental_id = p.rental_id
    GROUP BY c.customer_id, c.first_name, c.last_name
)
SELECT customer_id, first_name, last_name, total_spent
FROM customer_spending
WHERE spending_rank = 1  -- Top 20%
ORDER BY total_spent DESC;

In [ ]:
#8 Calculate the running total of rentals per category, ordered by rental count.
SELECT
    c.name AS category_name,
    f.title,
    COUNT(r.rental_id) AS rental_count,
    SUM(COUNT(r.rental_id)) OVER (PARTITION BY c.category_id ORDER BY COUNT(r.rental_id)) AS running_total
FROM film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
JOIN inventory i ON f.film_id = i.film_id
LEFT JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY c.category_id, c.name, f.film_id, f.title
ORDER BY category_name, rental_count;

In [ ]:
#ques 9 Find the films that have been rented less than the average rental count for their respective categories.

WITH CategoryRentalCount AS (
    SELECT
        f.film_id,
        c.name AS category_name,
        COUNT(r.rental_id) AS rental_count
    FROM film f
    JOIN film_category fc ON f.film_id = fc.film_id
    JOIN category c ON fc.category_id = c.category_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BYf.film_id, c.name
),
CategoryAvgRental AS (
    # Calculate the average rental count per category
    SELECTcategory_name, AVG(rental_count) AS avg_rental_count
    FROM CategoryRentalCount
    GROUP BY category_name
)
# Select films with rental counts less than the average for their category
SELECT
    crc.film_id,
    crc.category_name,
    crc.rental_count,
    ca.avg_rental_count
FROM CategoryRentalCount crc
JOIN CategoryAvgRental ca ON crc.category_name = ca.category_name
WHERE crc.rental_count < ca.avg_rental_count
ORDER BY crc.category_name, crc.rental_count;

In [ ]:
#ques 10  Identify the top 5 months with the highest revenue and display the revenue generated in each month.

SELECT
    DATE_FORMAT(p.payment_date, '%Y-%m') AS month,
    SUM(p.amount) AS total_revenue
FROM
    payment p
GROUP BY
    month
ORDER BY
    total_revenue DESC
LIMIT 5;

**Normalisation & CTE**

ques1  Identify a table in the Sakila database that violates 1NF. Explain how you would normalize it to achieve 1NF.

1NF definition : a table is in 1NF if each column contain only atomic 1NF Definition: A table is in 1NF if each column contains only atomic (indivisible) values, and there are no repeating groups of columns.
 * Sakila Example (Violation and Normalization):
   * It's less common to find blatant 1NF violations in well-designed relational databases like Sakila. However, let's create a hypothetical example to illustrate.
   * Hypothetical Violation: Imagine if the customer table had a column called phone that could store multiple phone numbers separated by commas (e.g., "123-456-7890, 987-654-3210"). This is a 1NF violation because the phone column has multiple values.
   * Normalization to 1NF: To fix this, you would create a separate table called customer_phone. This table would have columns like customer_id (foreign key referencing the customer table) and phone_number. Each row in customer_phone would store a single phone number for a customer.

ques 2 . Choose a table in Sakila and describe how you would determine whether it is in 2NF. If it violates 2NF, explain the steps to normalize it.

Second Normal Form (2NF)
 * 2NF Definition: A table is in 2NF if it is in 1NF and all non-key attributes are fully functionally dependent on the entire primary key. This is only relevant for tables with composite primary keys (a primary key made up of two or more columns).
 * Sakila Example:
   * Table: Let's consider a hypothetical table (or a simplification of something like film_actor) called film_actor_info with columns: film_id (part of the primary key), actor_id (part of the primary key), and actor_role.
   * 2NF Check:
     * The primary key is a composite key: (film_id, actor_id).
     * actor_role is functionally dependent on the entire primary key. Knowing both the film_id and the actor_id tells you the actor_role.
   * Violation Scenario: If we added an attribute like actor_birthdate to film_actor_info, and actor_birthdate is only dependent on actor_id (not film_id), then this table would violate 2NF.
   * Normalization to 2NF: To fix this, you'd create two tables:
     * film_actor: (film_id, actor_id, actor_role)
     * actor: (actor_id, actor_birthdate)

ques 3 Identify a table in Sakila that violates 3NF. Describe the transitive dependencies  present and outline the steps to normalize the table to 3NF.

Third Normal Form (3NF)
 * 3NF Definition: A table is in 2NF and no non-key attribute is transitively dependent on the primary key. Transitive dependency means that a non-key attribute depends on another non-key attribute, which in turn depends on the primary key.
 * Sakila Example:
   * Table: Consider the address table in Sakila. It has columns like address_id (primary key), address, city_id, and city.
   * 3NF Violation: Here, city is transitively dependent on address_id. address_id determines city_id, and city_id determines city.
   * Normalization to 3NF: To correct this, you would separate the city information into its own city table:
     * address: (address_id, address, city_id)
     * city: (city_id, city)

ques 4  Take a specific table in Sakila and guide through the process of normalizing it from the initial  unnormalized form up to at least 2NF

 Normalization Process (Example)
Let's take a simplified example and normalize it to 2NF:
 * Unnormalized Table: Imagine we have a table called order_details with the following columns: order_id, product_id, product_name, quantity, and product_price. In this table, order_id and product_id together form the primary key.
 * 1NF Check: Assume this table is already in 1NF (each column has atomic values).
 * 2NF Check:
   * Primary key: (order_id, product_id)
   * Dependencies:
     * product_name and product_price are dependent on product_id only.
     * quantity is dependent on both order_id and product_id.
 * 2NF Normalization:
   * Create order_product: (order_id, product_id, quantity)
   * Create product: (product_id, product_name, product_price)

In [ ]:
#ques 5 Write a query using a CTE to retrieve the distinct list of actor names and the number of films they have acted in from the actor and film_actor tables

 WITH ActorFilmCount AS (
    # Step 1: Calculate the number of films for each actor
    SELECT
        a.actor_id,
        CONCAT(a.first_name, ' ', a.last_name) AS actor_name,
        COUNT(fa.film_id) AS film_count
    FROM
        actor a
    JOIN
        film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY
        a.actor_id, actor_name
)
# Step 2: Select distinct actors and their film counts from the CTE
SELECT
    actor_name,
    film_count
FROM
    ActorFilmCount
ORDER BY
    film_count DESC;

In [ ]:
#ques 6  Create a CTE that combines information from the film and language tables to display the film title, language name, and rental rate


WITH FilmLanguageRental AS (
 # Combine information from the film and language tables
    SELECT
        f.title AS film_title,
        l.name AS language_name,
        f.rental_rate
    FROM
        film f
    JOIN
        language l ON f.language_id = l.language_id
)
SELECT
    film_title,
    language_name,
    rental_rate
FROM
    FilmLanguageRental
ORDER BY
    film_title;

In [ ]:
#ques 7  Write a query using a CTE to find the total revenue generated by each customer (sum of payments) from the customer and payment tables

WITH CustomerRevenue AS (
# Calculate the total revenue for each customer by summing their payments
    SELECT
        c.customer_id,
        CONCAT(c.first_name, ' ', c.last_name) AS customer_name,
        SUM(p.amount) AS total_revenue
    FROM
        customer c
    JOIN
        payment p ON c.customer_id = p.customer_id
    GROUP BY
        c.customer_id, customer_name
)
# Select customer names and their total revenue
SELECT
    customer_name,
    total_revenue
FROM
    CustomerRevenue
ORDER BY
    total_revenue DESC;

In [ ]:
#ques 8  Utilize a CTE with a window function to rank films based on their rental duration from the film table

 WITH FilmRanked AS (
#  Rank films based on their rental duration in descending order
    SELECT
        f.film_id,
        f.title AS film_title,
        f.rental_duration,
        RANK() OVER (ORDER BY f.rental_duration DESC) AS rental_rank
    FROM
        film f
)
# Select the ranked films
SELECT
    film_title,
    rental_duration,
    rental_rank
FROM
    FilmRanked
ORDER BY
    rental_rank;

In [ ]:
 C#ques 9 reate a CTE to list customers who have made more than two rentals, and then join this CTE with the customer table to retrieve additional customer details.

 WITH CustomerRentalCount AS (
    SELECT
        p.customer_id,
        COUNT(p.payment_id) AS rental_count
    FROM payment p
    GROUP BY  p.customer_id
    HAVING COUNT(p.payment_id) > 2
)
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    crc.rental_count
FROM CustomerRentalCount crc
JOIN customer c ON crc.customer_id = c.customer_id
ORDER BY  crc.rental_count DESC;

In [ ]:
#ques 10 Write a query using a CTE to find the total number of rentals made each month, considering the rental_date from the rental table.

WITH MonthlyRentals AS (
    SELECT
        DATE_FORMAT(r.rental_date, '%Y-%m') AS rental_month,
        COUNT(r.rental_id) AS rental_count
    FROM  rental r
    GROUP BY rental_month
)
SELECT rental_month, rental_count
FROM  MonthlyRentals
ORDER BY  rental_month ASC;

In [ ]:
#ques 11  Create a CTE to generate a report showing pairs of actors who have appeared in the same film together, using the film_actor table.

WITH ActorPairs AS (
    SELECT
        fa1.actor_id AS actor1_id,
        fa2.actor_id AS actor2_id,
        fa1.film_id
    FROM  film_actor fa1
    JOIN film_actor fa2 ON fa1.film_id = fa2.film_id
    WHERE fa1.actor_id < fa2.actor_id  -- Ensure we don't repeat pairs (actor1, actor2) and (actor2, actor1)
)
SELECT
    a1.first_name AS actor1_first_name,
    a1.last_name AS actor1_last_name,
    a2.first_name AS actor2_first_name,

In [ ]:
# ques 12  Implement a recursive CTE to find all employees in the staff table who report to a specific manager, considering the reports_to column

WITH RECURSIVE EmployeeHierarchy AS (
    SELECT
        s.staff_id,
        s.first_name,
        s.last_name,
        s.reports_to
    FROM
        staff s
    WHERE
        s.reports_to = <Manager_Staff_ID>

    UNION ALL
    SELECT
        s.staff_id,
        s.first_name,
        s.last_name,
        s.reports_to
    FROM
        staff s
    JOIN
        EmployeeHierarchy eh ON s.reports_to = eh.staff_id
)
SELECT
    staff_id,
    first_name,
    last_name,
    reports_to
FROM
    EmployeeHierarchy
ORDER BY
    staff_id;